Terraform plan output.

`

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_key_pair.key will be created
  + resource "aws_key_pair" "key" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "dbtunnel-bastion-ec2-user-ssh-key"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCtNfcjnlbnmMXcYuscE96X3jp6uXbcjMFeloBPpeV5r9WwuAcczo7Sm8gqUBDtQrJ/TtGTZ+plAX5w8RlbQ7NsWoOIMhHaKmR/USo2kxiwXfQ3J8nJH42lGT/1lDKR01q3rQvjSNF4sJ4uJ7Bb7XWWLnT4X0IxCHrmNAEX/TH0D8RByFbjiHmw0avsHBt58Qux7AtAgZ4zqN0Q4NI3BX7uK3hti9H2I/QM3GYIDJSzcas6PUKxSh/QmaGfae0UBhavE4mrYXwftK6Q2lL7flU8b01eL9q+sfS5ncMIE7FA99+fXFB3vm3INNZysaMUGh/cCS+5vGEm2kD/T/ZZWAMIngjr6KRSUAvinSKMfw1aILm0dpQgty3E9lXXJm4cE49jS/tull6didwwWEvtchYHZIGSz+F7yuLswukz8hNC2y1wKS8046yYgpdO2C41HcUpfJyQ7YmR5Q40FOJjXS9twxCSvbsDr/DfRqA11rPuXt0VwBKPAFWzonJ0jCSnrt8= ec2-user"
      + tags_all    = (known after apply)
    }

  # module.ssh_tunnel_testing.aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "dbtunnel-public-dbsubnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "12.6"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "tunnel-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "airbyte"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "rds-pg"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "airbyte"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.ssh_tunnel_testing.aws_db_parameter_group.default will be created
  + resource "aws_db_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "RDS default parameter group"
      + family      = "postgres12"
      + id          = (known after apply)
      + name        = "rds-pg"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssh_tunnel_testing.aws_db_subnet_group.default will be created
  + resource "aws_db_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "dbtunnel-public-dbsubnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "dbtunnel-public-dbsubnet-group"
        }
      + tags_all    = {
          + "Name" = "dbtunnel-public-dbsubnet-group"
        }
    }

  # module.ssh_tunnel_testing.aws_eip.dbtunnel-eip will be created
  + resource "aws_eip" "dbtunnel-eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.ssh_tunnel_testing.aws_eip_association.dbtunnel-eip-assoc will be created
  + resource "aws_eip_association" "dbtunnel-eip-assoc" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.ssh_tunnel_testing.aws_instance.dbtunnel-bastion will be created
  + resource "aws_instance" "dbtunnel-bastion" {
      + ami                                  = "ami-0233c2d874b811deb"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "dbtunnel-bastion-ec2-user-ssh-key"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "dbtunnel-bastion"
        }
      + tags_all                             = {
          + "Name" = "dbtunnel-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "9a9b3bb0f1cfa9adbe7636cff1da40a10353e82b"
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ssh_tunnel_testing.aws_route_table.dbtunnel-public-route will be created
  + resource "aws_route_table" "dbtunnel-public-route" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-03f43f8e7909d7975"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "dbtunnel-public-route"
        }
      + tags_all         = {
          + "Name" = "dbtunnel-public-route"
        }
      + vpc_id           = "vpc-001ad881b80193126"
    }

  # module.ssh_tunnel_testing.aws_route_table_association.dbtunnel-route-assoc-private-subnet-2 will be created
  + resource "aws_route_table_association" "dbtunnel-route-assoc-private-subnet-2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ssh_tunnel_testing.aws_route_table_association.dbtunnel-route-assoc-public-subnet-1 will be created
  + resource "aws_route_table_association" "dbtunnel-route-assoc-public-subnet-1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.ssh_tunnel_testing.aws_security_group.dbtunnel-sg will be created
  + resource "aws_security_group" "dbtunnel-sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic but only from the dbtunnel subnet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.40.0/24",
                ]
              + description      = "tcp on 5432 from subnet"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "dbtunnel-sg-allow-postgres"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dbtunnel-sg-allow-postgres"
        }
      + tags_all               = {
          + "Name" = "dbtunnel-sg-allow-postgres"
        }
      + vpc_id                 = "vpc-001ad881b80193126"
    }

  # module.ssh_tunnel_testing.aws_security_group.ssh-and-egress-allowed will be created
  + resource "aws_security_group" "ssh-and-egress-allowed" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ssh-and-egress-allowed"
        }
      + tags_all               = {
          + "Name" = "ssh-and-egress-allowed"
        }
      + vpc_id                 = "vpc-001ad881b80193126"
    }

  # module.ssh_tunnel_testing.aws_subnet.main-subnet-private-dbtunnel will be created
  + resource "aws_subnet" "main-subnet-private-dbtunnel" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.41.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "private-dbtunnel"
        }
      + tags_all                        = {
          + "Name" = "private-dbtunnel"
        }
      + vpc_id                          = "vpc-001ad881b80193126"
    }

  # module.ssh_tunnel_testing.aws_subnet.main-subnet-public-dbtunnel will be created
  + resource "aws_subnet" "main-subnet-public-dbtunnel" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.40.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "public-dbtunnel"
        }
      + tags_all                        = {
          + "Name" = "public-dbtunnel"
        }
      + vpc_id                          = "vpc-001ad881b80193126"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

`